Revit 2027 API
IPointCloudAccess.CreatePointSetIterator(PointCloudFilter, ElementId) Method
 Implement this method to return an iterator for iterating over blocks of this point cloud.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IPointSetIterator CreatePointSetIterator(
	PointCloudFilter rFilter,
	ElementId viewId
)
Function CreatePointSetIterator (
	rFilter As PointCloudFilter,
	viewId As ElementId
) As IPointSetIterator
IPointSetIterator^ CreatePointSetIterator(
	PointCloudFilter^ rFilter,
	ElementId^ viewId
)
abstract CreatePointSetIterator :
        rFilter : PointCloudFilter *
        viewId : ElementId -> IPointSetIterator
Parameters
rFilter PointCloudFilter
 The filter used to process cloud points and determine which ones lie with the target volume.
viewId ElementId
 The view id for the current view passed as auxiliary information to allow the engine to optimize retrieval of points. If viewId == InvalidElementId, the query is not for a view display operation.
Return Value
IPointSetIterator
 The newly created iterator.
See Also
Reference
IPointCloudAccess Interface
CreatePointSetIterator Overload
Autodesk.Revit.DB.PointClouds Namespace